In [1]:
import sys
# !{sys.executable} -m pip install pymysql mysqlclient jupysql

In [2]:
import os
from dotenv import load_dotenv

load_dotenv()

True

In [3]:
# user = os.environ["DB_USERNAME"]
# pwd = os.environ["DB_PASSWORD"]
# host = os.environ["DB_HOST"]

In [4]:
%load_ext sql
%sql mysql+mysqldb://$DB_USERNAME:$DB_PASSWORD@$DB_HOST:3306/parks_and_recreation
%config SqlMagic.displaylimit = None

Connecting to 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

displaylimit: Value None will be treated as 0 (no limit)

## SQL_01

In [5]:
%%sql
SELECT *
FROM parks_and_recreation.employee_demographics;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

12 rows affected.

+-------------+---------------+--------------+------+--------+------------+
| employee_id |   first_name  |  last_name   | age  | gender | birth_date |
+-------------+---------------+--------------+------+--------+------------+
|      1      |     Leslie    |    Knope     |  44  | Female | 1979-09-25 |
|      3      |      Tom      |  Haverford   |  36  |  Male  | 1987-03-04 |
|      4      |     April     |   Ludgate    |  29  | Female | 1994-03-27 |
|      5      |     Jerry     |   Gergich    |  61  |  Male  | 1962-08-28 |
|      6      |     Donna     |    Meagle    |  46  | Female | 1977-07-30 |
|      7      |      Ann      |   Perkins    |  35  | Female | 1988-12-01 |
|      8      |     Chris     |   Traeger    |  43  |  Male  | 1980-11-11 |
|      9      |      Ben      |    Wyatt     |  38  |  Male  | 1985-07-26 |
|      10     |      Andy     |    Dwyer     |  34  |  Male  | 1989-03-25 |
|      11     |      Mark     | Brendanawicz |  40  |  Male  | 1983-06-14 |
|      12     |     Craig     | Middlebrooks |  37  |  Male  | 1986-07-27 |
|      13     | Jean-Ralphino |  Saperstein  | None |  None  |    None    |
+-------------+---------------+--------------+------+--------+------------+

In [6]:
%%sql
SELECT
    first_name
FROM
    parks_and_recreation.employee_demographics;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

12 rows affected.

+---------------+
|   first_name  |
+---------------+
|     Leslie    |
|      Tom      |
|     April     |
|     Jerry     |
|     Donna     |
|      Ann      |
|     Chris     |
|      Ben      |
|      Andy     |
|      Mark     |
|     Craig     |
| Jean-Ralphino |
+---------------+

In [7]:
%%sql
SELECT
    first_name,
    last_name,
    birth_date
FROM
    parks_and_recreation.employee_demographics;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

12 rows affected.

+---------------+--------------+------------+
|   first_name  |  last_name   | birth_date |
+---------------+--------------+------------+
|     Leslie    |    Knope     | 1979-09-25 |
|      Tom      |  Haverford   | 1987-03-04 |
|     April     |   Ludgate    | 1994-03-27 |
|     Jerry     |   Gergich    | 1962-08-28 |
|     Donna     |    Meagle    | 1977-07-30 |
|      Ann      |   Perkins    | 1988-12-01 |
|     Chris     |   Traeger    | 1980-11-11 |
|      Ben      |    Wyatt     | 1985-07-26 |
|      Andy     |    Dwyer     | 1989-03-25 |
|      Mark     | Brendanawicz | 1983-06-14 |
|     Craig     | Middlebrooks | 1986-07-27 |
| Jean-Ralphino |  Saperstein  |    None    |
+---------------+--------------+------------+

In [8]:
%%sql
SELECT
    first_name,
    last_name,
    birth_date,
    age,
    age + 10 as op_1,
    (age + 10) * 2 as op_2,
    age + 10 * 2 as op_3 # example
FROM
    parks_and_recreation.employee_demographics;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

12 rows affected.

+---------------+--------------+------------+------+------+------+------+
|   first_name  |  last_name   | birth_date | age  | op_1 | op_2 | op_3 |
+---------------+--------------+------------+------+------+------+------+
|     Leslie    |    Knope     | 1979-09-25 |  44  |  54  | 108  |  64  |
|      Tom      |  Haverford   | 1987-03-04 |  36  |  46  |  92  |  56  |
|     April     |   Ludgate    | 1994-03-27 |  29  |  39  |  78  |  49  |
|     Jerry     |   Gergich    | 1962-08-28 |  61  |  71  | 142  |  81  |
|     Donna     |    Meagle    | 1977-07-30 |  46  |  56  | 112  |  66  |
|      Ann      |   Perkins    | 1988-12-01 |  35  |  45  |  90  |  55  |
|     Chris     |   Traeger    | 1980-11-11 |  43  |  53  | 106  |  63  |
|      Ben      |    Wyatt     | 1985-07-26 |  38  |  48  |  96  |  58  |
|      Andy     |    Dwyer     | 1989-03-25 |  34  |  44  |  88  |  54  |
|      Mark     | Brendanawicz | 1983-06-14 |  40  |  50  | 100  |  60  |
|     Craig     | Middlebrooks | 1986-07-27 |  37  |  47  |  94  |  57  |
| Jean-Ralphino |  Saperstein  |    None    | None | None | None | None |
+---------------+--------------+------------+------+------+------+------+

**PAMDAS**: Parentheses (Paréntesis), Exponents (Exponentes) , Multiplication-Division (Multiplicación-División), Addition-Subtraction (Suma y resta).

In [9]:
%%sql
SELECT
    distinct(gender),
    count(gender) as total
FROM
    parks_and_recreation.employee_demographics
GROUP BY gender
ORDER BY total desc;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

3 rows affected.

+--------+-------+
| gender | total |
+--------+-------+
|  Male  |   7   |
| Female |   4   |
|  None  |   0   |
+--------+-------+

## SQL_02

In [10]:
%%sql
SELECT *
FROM
    parks_and_recreation.employee_salary
WHERE first_name = "Leslie";

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

1 rows affected.

+-------------+------------+-----------+-----------------------------------------+--------+---------+
| employee_id | first_name | last_name |                occupation               | salary | dept_id |
+-------------+------------+-----------+-----------------------------------------+--------+---------+
|      1      |   Leslie   |   Knope   | Deputy Director of Parks and Recreation | 75000  |    1    |
+-------------+------------+-----------+-----------------------------------------+--------+---------+

In [11]:
%%sql
SELECT *
FROM
    parks_and_recreation.employee_salary
WHERE salary >= 50000;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

11 rows affected.

+-------------+---------------+--------------+-----------------------------------------+---------+---------+
| employee_id |   first_name  |  last_name   |                occupation               |  salary | dept_id |
+-------------+---------------+--------------+-----------------------------------------+---------+---------+
|      1      |     Leslie    |    Knope     | Deputy Director of Parks and Recreation |  75000  |    1    |
|      2      |      Ron      |   Swanson    |     Director of Parks and Recreation    |  70000  |    1    |
|      3      |      Tom      |  Haverford   |               Entrepreneur              |  50000  |    1    |
|      5      |     Jerry     |   Gergich    |              Office Manager             |  50000  |    1    |
|      6      |     Donna     |    Meagle    |              Office Manager             |  60000  |    1    |
|      7      |      Ann      |   Perkins    |                  Nurse                  |  55000  |    4    |
|      8      |     Chris     |   Traeger    |               City Manager              |  90000  |    3    |
|      9      |      Ben      |    Wyatt     |              State Auditor              |  70000  |    6    |
|      11     |      Mark     | Brendanawicz |               City Planner              |  57000  |    3    |
|      12     |     Craig     | Middlebrooks |              Parks Director             |  65000  |    1    |
|      13     | Jean-Ralphino |  Saperstein  |          Exnternainment 720 CEO         | 1000000 |   None  |
+-------------+---------------+--------------+-----------------------------------------+---------+---------+

In [12]:
%%sql
SELECT *
FROM
    parks_and_recreation.employee_salary
WHERE salary <= 50000;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

4 rows affected.

+-------------+------------+-----------+---------------------------------------------------+--------+---------+
| employee_id | first_name | last_name |                     occupation                    | salary | dept_id |
+-------------+------------+-----------+---------------------------------------------------+--------+---------+
|      3      |    Tom     | Haverford |                    Entrepreneur                   | 50000  |    1    |
|      4      |   April    |  Ludgate  | Assistant to the Director of Parks and Recreation | 25000  |    1    |
|      5      |   Jerry    |  Gergich  |                   Office Manager                  | 50000  |    1    |
|      10     |    Andy    |   Dwyer   |              Shoe Shiner and Musician             | 20000  |   None  |
+-------------+------------+-----------+---------------------------------------------------+--------+---------+

In [13]:
%%sql
SELECT *
FROM
    parks_and_recreation.employee_demographics;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

12 rows affected.

+-------------+---------------+--------------+------+--------+------------+
| employee_id |   first_name  |  last_name   | age  | gender | birth_date |
+-------------+---------------+--------------+------+--------+------------+
|      1      |     Leslie    |    Knope     |  44  | Female | 1979-09-25 |
|      3      |      Tom      |  Haverford   |  36  |  Male  | 1987-03-04 |
|      4      |     April     |   Ludgate    |  29  | Female | 1994-03-27 |
|      5      |     Jerry     |   Gergich    |  61  |  Male  | 1962-08-28 |
|      6      |     Donna     |    Meagle    |  46  | Female | 1977-07-30 |
|      7      |      Ann      |   Perkins    |  35  | Female | 1988-12-01 |
|      8      |     Chris     |   Traeger    |  43  |  Male  | 1980-11-11 |
|      9      |      Ben      |    Wyatt     |  38  |  Male  | 1985-07-26 |
|      10     |      Andy     |    Dwyer     |  34  |  Male  | 1989-03-25 |
|      11     |      Mark     | Brendanawicz |  40  |  Male  | 1983-06-14 |
|      12     |     Craig     | Middlebrooks |  37  |  Male  | 1986-07-27 |
|      13     | Jean-Ralphino |  Saperstein  | None |  None  |    None    |
+-------------+---------------+--------------+------+--------+------------+

In [14]:
%%sql
SELECT *
FROM
    parks_and_recreation.employee_demographics
WHERE gender = "Female";

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

4 rows affected.

+-------------+------------+-----------+-----+--------+------------+
| employee_id | first_name | last_name | age | gender | birth_date |
+-------------+------------+-----------+-----+--------+------------+
|      1      |   Leslie   |   Knope   |  44 | Female | 1979-09-25 |
|      4      |   April    |  Ludgate  |  29 | Female | 1994-03-27 |
|      6      |   Donna    |   Meagle  |  46 | Female | 1977-07-30 |
|      7      |    Ann     |  Perkins  |  35 | Female | 1988-12-01 |
+-------------+------------+-----------+-----+--------+------------+

In [15]:
%%sql
SELECT *
FROM
    parks_and_recreation.employee_demographics
WHERE gender != "Female";

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

7 rows affected.

+-------------+------------+--------------+-----+--------+------------+
| employee_id | first_name |  last_name   | age | gender | birth_date |
+-------------+------------+--------------+-----+--------+------------+
|      3      |    Tom     |  Haverford   |  36 |  Male  | 1987-03-04 |
|      5      |   Jerry    |   Gergich    |  61 |  Male  | 1962-08-28 |
|      8      |   Chris    |   Traeger    |  43 |  Male  | 1980-11-11 |
|      9      |    Ben     |    Wyatt     |  38 |  Male  | 1985-07-26 |
|      10     |    Andy    |    Dwyer     |  34 |  Male  | 1989-03-25 |
|      11     |    Mark    | Brendanawicz |  40 |  Male  | 1983-06-14 |
|      12     |   Craig    | Middlebrooks |  37 |  Male  | 1986-07-27 |
+-------------+------------+--------------+-----+--------+------------+

In [16]:
%%sql
SELECT *
FROM
    parks_and_recreation.employee_demographics
WHERE birth_date >= "1985-01-01";

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

6 rows affected.

+-------------+------------+--------------+-----+--------+------------+
| employee_id | first_name |  last_name   | age | gender | birth_date |
+-------------+------------+--------------+-----+--------+------------+
|      3      |    Tom     |  Haverford   |  36 |  Male  | 1987-03-04 |
|      4      |   April    |   Ludgate    |  29 | Female | 1994-03-27 |
|      7      |    Ann     |   Perkins    |  35 | Female | 1988-12-01 |
|      9      |    Ben     |    Wyatt     |  38 |  Male  | 1985-07-26 |
|      10     |    Andy    |    Dwyer     |  34 |  Male  | 1989-03-25 |
|      12     |   Craig    | Middlebrooks |  37 |  Male  | 1986-07-27 |
+-------------+------------+--------------+-----+--------+------------+

In [17]:
%%sql
SELECT *
FROM
    parks_and_recreation.employee_demographics
WHERE birth_date > "1985-01-01" AND gender = "male";

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

4 rows affected.

+-------------+------------+--------------+-----+--------+------------+
| employee_id | first_name |  last_name   | age | gender | birth_date |
+-------------+------------+--------------+-----+--------+------------+
|      3      |    Tom     |  Haverford   |  36 |  Male  | 1987-03-04 |
|      9      |    Ben     |    Wyatt     |  38 |  Male  | 1985-07-26 |
|      10     |    Andy    |    Dwyer     |  34 |  Male  | 1989-03-25 |
|      12     |   Craig    | Middlebrooks |  37 |  Male  | 1986-07-27 |
+-------------+------------+--------------+-----+--------+------------+

In [18]:
%%sql
SELECT *
FROM
    parks_and_recreation.employee_demographics
WHERE birth_date > "1985-01-01" OR gender = "male";

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

9 rows affected.

+-------------+------------+--------------+-----+--------+------------+
| employee_id | first_name |  last_name   | age | gender | birth_date |
+-------------+------------+--------------+-----+--------+------------+
|      3      |    Tom     |  Haverford   |  36 |  Male  | 1987-03-04 |
|      4      |   April    |   Ludgate    |  29 | Female | 1994-03-27 |
|      5      |   Jerry    |   Gergich    |  61 |  Male  | 1962-08-28 |
|      7      |    Ann     |   Perkins    |  35 | Female | 1988-12-01 |
|      8      |   Chris    |   Traeger    |  43 |  Male  | 1980-11-11 |
|      9      |    Ben     |    Wyatt     |  38 |  Male  | 1985-07-26 |
|      10     |    Andy    |    Dwyer     |  34 |  Male  | 1989-03-25 |
|      11     |    Mark    | Brendanawicz |  40 |  Male  | 1983-06-14 |
|      12     |   Craig    | Middlebrooks |  37 |  Male  | 1986-07-27 |
+-------------+------------+--------------+-----+--------+------------+

In [19]:
%%sql
SELECT *
FROM
    parks_and_recreation.employee_demographics
WHERE birth_date > "1985-01-01" OR NOT gender = "male";

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

8 rows affected.

+-------------+------------+--------------+-----+--------+------------+
| employee_id | first_name |  last_name   | age | gender | birth_date |
+-------------+------------+--------------+-----+--------+------------+
|      1      |   Leslie   |    Knope     |  44 | Female | 1979-09-25 |
|      3      |    Tom     |  Haverford   |  36 |  Male  | 1987-03-04 |
|      4      |   April    |   Ludgate    |  29 | Female | 1994-03-27 |
|      6      |   Donna    |    Meagle    |  46 | Female | 1977-07-30 |
|      7      |    Ann     |   Perkins    |  35 | Female | 1988-12-01 |
|      9      |    Ben     |    Wyatt     |  38 |  Male  | 1985-07-26 |
|      10     |    Andy    |    Dwyer     |  34 |  Male  | 1989-03-25 |
|      12     |   Craig    | Middlebrooks |  37 |  Male  | 1986-07-27 |
+-------------+------------+--------------+-----+--------+------------+

In [20]:
%%sql
SELECT *
FROM
    parks_and_recreation.employee_demographics
WHERE first_name LIKE "a%"; --inicia con "a"

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

3 rows affected.

+-------------+------------+-----------+-----+--------+------------+
| employee_id | first_name | last_name | age | gender | birth_date |
+-------------+------------+-----------+-----+--------+------------+
|      4      |   April    |  Ludgate  |  29 | Female | 1994-03-27 |
|      7      |    Ann     |  Perkins  |  35 | Female | 1988-12-01 |
|      10     |    Andy    |   Dwyer   |  34 |  Male  | 1989-03-25 |
+-------------+------------+-----------+-----+--------+------------+

In [21]:
%%sql
SELECT *
FROM
    parks_and_recreation.employee_demographics
WHERE first_name LIKE "a___%"; --underscore only one character (any)

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

2 rows affected.

+-------------+------------+-----------+-----+--------+------------+
| employee_id | first_name | last_name | age | gender | birth_date |
+-------------+------------+-----------+-----+--------+------------+
|      4      |   April    |  Ludgate  |  29 | Female | 1994-03-27 |
|      10     |    Andy    |   Dwyer   |  34 |  Male  | 1989-03-25 |
+-------------+------------+-----------+-----+--------+------------+

In [22]:
%%sql
SELECT *
FROM
    parks_and_recreation.employee_demographics
WHERE birth_date LIKE "1989%";

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

1 rows affected.

+-------------+------------+-----------+-----+--------+------------+
| employee_id | first_name | last_name | age | gender | birth_date |
+-------------+------------+-----------+-----+--------+------------+
|      10     |    Andy    |   Dwyer   |  34 |  Male  | 1989-03-25 |
+-------------+------------+-----------+-----+--------+------------+

## SQL_03

In [23]:
%%sql
SELECT *
FROM
    parks_and_recreation.employee_demographics;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

12 rows affected.

+-------------+---------------+--------------+------+--------+------------+
| employee_id |   first_name  |  last_name   | age  | gender | birth_date |
+-------------+---------------+--------------+------+--------+------------+
|      1      |     Leslie    |    Knope     |  44  | Female | 1979-09-25 |
|      3      |      Tom      |  Haverford   |  36  |  Male  | 1987-03-04 |
|      4      |     April     |   Ludgate    |  29  | Female | 1994-03-27 |
|      5      |     Jerry     |   Gergich    |  61  |  Male  | 1962-08-28 |
|      6      |     Donna     |    Meagle    |  46  | Female | 1977-07-30 |
|      7      |      Ann      |   Perkins    |  35  | Female | 1988-12-01 |
|      8      |     Chris     |   Traeger    |  43  |  Male  | 1980-11-11 |
|      9      |      Ben      |    Wyatt     |  38  |  Male  | 1985-07-26 |
|      10     |      Andy     |    Dwyer     |  34  |  Male  | 1989-03-25 |
|      11     |      Mark     | Brendanawicz |  40  |  Male  | 1983-06-14 |
|      12     |     Craig     | Middlebrooks |  37  |  Male  | 1986-07-27 |
|      13     | Jean-Ralphino |  Saperstein  | None |  None  |    None    |
+-------------+---------------+--------------+------+--------+------------+

In [24]:
%%sql
SELECT
    gender,
    count(gender) as total
FROM
    parks_and_recreation.employee_demographics
GROUP BY gender;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

3 rows affected.

+--------+-------+
| gender | total |
+--------+-------+
| Female |   4   |
|  Male  |   7   |
|  None  |   0   |
+--------+-------+

In [25]:
%%sql
SELECT
    gender,
    AVG(age)
FROM
    parks_and_recreation.employee_demographics
GROUP BY gender;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

3 rows affected.

+--------+----------+
| gender | AVG(age) |
+--------+----------+
| Female | 38.5000  |
|  Male  | 41.2857  |
|  None  |   None   |
+--------+----------+

In [26]:
%%sql
SELECT
    occupation,
    count(occupation)
FROM
    parks_and_recreation.employee_salary
GROUP BY occupation;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

12 rows affected.

+---------------------------------------------------+-------------------+
|                     occupation                    | count(occupation) |
+---------------------------------------------------+-------------------+
|      Deputy Director of Parks and Recreation      |         1         |
|          Director of Parks and Recreation         |         1         |
|                    Entrepreneur                   |         1         |
| Assistant to the Director of Parks and Recreation |         1         |
|                   Office Manager                  |         2         |
|                       Nurse                       |         1         |
|                    City Manager                   |         1         |
|                   State Auditor                   |         1         |
|              Shoe Shiner and Musician             |         1         |
|                    City Planner                   |         1         |
|                   Parks Director                  |         1         |
|               Exnternainment 720 CEO              |         1         |
+---------------------------------------------------+-------------------+

In [27]:
%%sql
SELECT
    occupation,
    salary
FROM
    parks_and_recreation.employee_salary
GROUP BY occupation, salary;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

13 rows affected.

+---------------------------------------------------+---------+
|                     occupation                    |  salary |
+---------------------------------------------------+---------+
|      Deputy Director of Parks and Recreation      |  75000  |
|          Director of Parks and Recreation         |  70000  |
|                    Entrepreneur                   |  50000  |
| Assistant to the Director of Parks and Recreation |  25000  |
|                   Office Manager                  |  50000  |
|                   Office Manager                  |  60000  |
|                       Nurse                       |  55000  |
|                    City Manager                   |  90000  |
|                   State Auditor                   |  70000  |
|              Shoe Shiner and Musician             |  20000  |
|                    City Planner                   |  57000  |
|                   Parks Director                  |  65000  |
|               Exnternainment 720 CEO              | 1000000 |
+---------------------------------------------------+---------+

In [28]:
%%sql
SELECT
    gender,
    AVG(age),
    MAX(age),
    MIN(age),
    COUNT(age)
FROM
    parks_and_recreation.employee_demographics
GROUP BY gender;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

3 rows affected.

+--------+----------+----------+----------+------------+
| gender | AVG(age) | MAX(age) | MIN(age) | COUNT(age) |
+--------+----------+----------+----------+------------+
| Female | 38.5000  |    46    |    29    |     4      |
|  Male  | 41.2857  |    61    |    34    |     7      |
|  None  |   None   |   None   |   None   |     0      |
+--------+----------+----------+----------+------------+

In [29]:
%%sql
SELECT *
FROM
    parks_and_recreation.employee_demographics;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

12 rows affected.

+-------------+---------------+--------------+------+--------+------------+
| employee_id |   first_name  |  last_name   | age  | gender | birth_date |
+-------------+---------------+--------------+------+--------+------------+
|      1      |     Leslie    |    Knope     |  44  | Female | 1979-09-25 |
|      3      |      Tom      |  Haverford   |  36  |  Male  | 1987-03-04 |
|      4      |     April     |   Ludgate    |  29  | Female | 1994-03-27 |
|      5      |     Jerry     |   Gergich    |  61  |  Male  | 1962-08-28 |
|      6      |     Donna     |    Meagle    |  46  | Female | 1977-07-30 |
|      7      |      Ann      |   Perkins    |  35  | Female | 1988-12-01 |
|      8      |     Chris     |   Traeger    |  43  |  Male  | 1980-11-11 |
|      9      |      Ben      |    Wyatt     |  38  |  Male  | 1985-07-26 |
|      10     |      Andy     |    Dwyer     |  34  |  Male  | 1989-03-25 |
|      11     |      Mark     | Brendanawicz |  40  |  Male  | 1983-06-14 |
|      12     |     Craig     | Middlebrooks |  37  |  Male  | 1986-07-27 |
|      13     | Jean-Ralphino |  Saperstein  | None |  None  |    None    |
+-------------+---------------+--------------+------+--------+------------+

In [30]:
%%sql
SELECT *
FROM
    parks_and_recreation.employee_demographics
ORDER BY first_name ASC;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

12 rows affected.

+-------------+---------------+--------------+------+--------+------------+
| employee_id |   first_name  |  last_name   | age  | gender | birth_date |
+-------------+---------------+--------------+------+--------+------------+
|      10     |      Andy     |    Dwyer     |  34  |  Male  | 1989-03-25 |
|      7      |      Ann      |   Perkins    |  35  | Female | 1988-12-01 |
|      4      |     April     |   Ludgate    |  29  | Female | 1994-03-27 |
|      9      |      Ben      |    Wyatt     |  38  |  Male  | 1985-07-26 |
|      8      |     Chris     |   Traeger    |  43  |  Male  | 1980-11-11 |
|      12     |     Craig     | Middlebrooks |  37  |  Male  | 1986-07-27 |
|      6      |     Donna     |    Meagle    |  46  | Female | 1977-07-30 |
|      13     | Jean-Ralphino |  Saperstein  | None |  None  |    None    |
|      5      |     Jerry     |   Gergich    |  61  |  Male  | 1962-08-28 |
|      1      |     Leslie    |    Knope     |  44  | Female | 1979-09-25 |
|      11     |      Mark     | Brendanawicz |  40  |  Male  | 1983-06-14 |
|      3      |      Tom      |  Haverford   |  36  |  Male  | 1987-03-04 |
+-------------+---------------+--------------+------+--------+------------+

In [31]:
%%sql
SELECT *
FROM
    parks_and_recreation.employee_demographics
ORDER BY gender;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

12 rows affected.

+-------------+---------------+--------------+------+--------+------------+
| employee_id |   first_name  |  last_name   | age  | gender | birth_date |
+-------------+---------------+--------------+------+--------+------------+
|      13     | Jean-Ralphino |  Saperstein  | None |  None  |    None    |
|      1      |     Leslie    |    Knope     |  44  | Female | 1979-09-25 |
|      4      |     April     |   Ludgate    |  29  | Female | 1994-03-27 |
|      6      |     Donna     |    Meagle    |  46  | Female | 1977-07-30 |
|      7      |      Ann      |   Perkins    |  35  | Female | 1988-12-01 |
|      3      |      Tom      |  Haverford   |  36  |  Male  | 1987-03-04 |
|      5      |     Jerry     |   Gergich    |  61  |  Male  | 1962-08-28 |
|      8      |     Chris     |   Traeger    |  43  |  Male  | 1980-11-11 |
|      9      |      Ben      |    Wyatt     |  38  |  Male  | 1985-07-26 |
|      10     |      Andy     |    Dwyer     |  34  |  Male  | 1989-03-25 |
|      11     |      Mark     | Brendanawicz |  40  |  Male  | 1983-06-14 |
|      12     |     Craig     | Middlebrooks |  37  |  Male  | 1986-07-27 |
+-------------+---------------+--------------+------+--------+------------+

In [32]:
%%sql
SELECT *
FROM
    parks_and_recreation.employee_demographics
ORDER BY gender, age DESC;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

12 rows affected.

+-------------+---------------+--------------+------+--------+------------+
| employee_id |   first_name  |  last_name   | age  | gender | birth_date |
+-------------+---------------+--------------+------+--------+------------+
|      13     | Jean-Ralphino |  Saperstein  | None |  None  |    None    |
|      6      |     Donna     |    Meagle    |  46  | Female | 1977-07-30 |
|      1      |     Leslie    |    Knope     |  44  | Female | 1979-09-25 |
|      7      |      Ann      |   Perkins    |  35  | Female | 1988-12-01 |
|      4      |     April     |   Ludgate    |  29  | Female | 1994-03-27 |
|      5      |     Jerry     |   Gergich    |  61  |  Male  | 1962-08-28 |
|      8      |     Chris     |   Traeger    |  43  |  Male  | 1980-11-11 |
|      11     |      Mark     | Brendanawicz |  40  |  Male  | 1983-06-14 |
|      9      |      Ben      |    Wyatt     |  38  |  Male  | 1985-07-26 |
|      12     |     Craig     | Middlebrooks |  37  |  Male  | 1986-07-27 |
|      3      |      Tom      |  Haverford   |  36  |  Male  | 1987-03-04 |
|      10     |      Andy     |    Dwyer     |  34  |  Male  | 1989-03-25 |
+-------------+---------------+--------------+------+--------+------------+

In [33]:
%%sql
SELECT *
FROM
    parks_and_recreation.employee_demographics
ORDER BY age, gender;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

12 rows affected.

+-------------+---------------+--------------+------+--------+------------+
| employee_id |   first_name  |  last_name   | age  | gender | birth_date |
+-------------+---------------+--------------+------+--------+------------+
|      13     | Jean-Ralphino |  Saperstein  | None |  None  |    None    |
|      4      |     April     |   Ludgate    |  29  | Female | 1994-03-27 |
|      10     |      Andy     |    Dwyer     |  34  |  Male  | 1989-03-25 |
|      7      |      Ann      |   Perkins    |  35  | Female | 1988-12-01 |
|      3      |      Tom      |  Haverford   |  36  |  Male  | 1987-03-04 |
|      12     |     Craig     | Middlebrooks |  37  |  Male  | 1986-07-27 |
|      9      |      Ben      |    Wyatt     |  38  |  Male  | 1985-07-26 |
|      11     |      Mark     | Brendanawicz |  40  |  Male  | 1983-06-14 |
|      8      |     Chris     |   Traeger    |  43  |  Male  | 1980-11-11 |
|      1      |     Leslie    |    Knope     |  44  | Female | 1979-09-25 |
|      6      |     Donna     |    Meagle    |  46  | Female | 1977-07-30 |
|      5      |     Jerry     |   Gergich    |  61  |  Male  | 1962-08-28 |
+-------------+---------------+--------------+------+--------+------------+

In [34]:
%%sql
SELECT *
FROM
    parks_and_recreation.employee_demographics
ORDER BY 5, 4; --columns

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

12 rows affected.

+-------------+---------------+--------------+------+--------+------------+
| employee_id |   first_name  |  last_name   | age  | gender | birth_date |
+-------------+---------------+--------------+------+--------+------------+
|      13     | Jean-Ralphino |  Saperstein  | None |  None  |    None    |
|      4      |     April     |   Ludgate    |  29  | Female | 1994-03-27 |
|      7      |      Ann      |   Perkins    |  35  | Female | 1988-12-01 |
|      1      |     Leslie    |    Knope     |  44  | Female | 1979-09-25 |
|      6      |     Donna     |    Meagle    |  46  | Female | 1977-07-30 |
|      10     |      Andy     |    Dwyer     |  34  |  Male  | 1989-03-25 |
|      3      |      Tom      |  Haverford   |  36  |  Male  | 1987-03-04 |
|      12     |     Craig     | Middlebrooks |  37  |  Male  | 1986-07-27 |
|      9      |      Ben      |    Wyatt     |  38  |  Male  | 1985-07-26 |
|      11     |      Mark     | Brendanawicz |  40  |  Male  | 1983-06-14 |
|      8      |     Chris     |   Traeger    |  43  |  Male  | 1980-11-11 |
|      5      |     Jerry     |   Gergich    |  61  |  Male  | 1962-08-28 |
+-------------+---------------+--------------+------+--------+------------+

## SQL_04
Having vs. Where

In [35]:
%%sql
SELECT
    gender,
    AVG(age)
FROM
    parks_and_recreation.employee_demographics
GROUP BY gender;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

3 rows affected.

+--------+----------+
| gender | AVG(age) |
+--------+----------+
| Female | 38.5000  |
|  Male  | 41.2857  |
|  None  |   None   |
+--------+----------+

In [36]:
%%sql
SELECT
    gender,
    AVG(age)
FROM
    parks_and_recreation.employee_demographics
GROUP BY gender
HAVING AVG(age) > 40;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

1 rows affected.

+--------+----------+
| gender | AVG(age) |
+--------+----------+
|  Male  | 41.2857  |
+--------+----------+

In [37]:
%%sql
SELECT *
FROM
    parks_and_recreation.employee_salary;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

13 rows affected.

+-------------+---------------+--------------+---------------------------------------------------+---------+---------+
| employee_id |   first_name  |  last_name   |                     occupation                    |  salary | dept_id |
+-------------+---------------+--------------+---------------------------------------------------+---------+---------+
|      1      |     Leslie    |    Knope     |      Deputy Director of Parks and Recreation      |  75000  |    1    |
|      2      |      Ron      |   Swanson    |          Director of Parks and Recreation         |  70000  |    1    |
|      3      |      Tom      |  Haverford   |                    Entrepreneur                   |  50000  |    1    |
|      4      |     April     |   Ludgate    | Assistant to the Director of Parks and Recreation |  25000  |    1    |
|      5      |     Jerry     |   Gergich    |                   Office Manager                  |  50000  |    1    |
|      6      |     Donna     |    Meagle    |                   Office Manager                  |  60000  |    1    |
|      7      |      Ann      |   Perkins    |                       Nurse                       |  55000  |    4    |
|      8      |     Chris     |   Traeger    |                    City Manager                   |  90000  |    3    |
|      9      |      Ben      |    Wyatt     |                   State Auditor                   |  70000  |    6    |
|      10     |      Andy     |    Dwyer     |              Shoe Shiner and Musician             |  20000  |   None  |
|      11     |      Mark     | Brendanawicz |                    City Planner                   |  57000  |    3    |
|      12     |     Craig     | Middlebrooks |                   Parks Director                  |  65000  |    1    |
|      13     | Jean-Ralphino |  Saperstein  |               Exnternainment 720 CEO              | 1000000 |   None  |
+-------------+---------------+--------------+---------------------------------------------------+---------+---------+

In [38]:
%%sql
SELECT
    occupation,
    AVG(salary)
FROM
    parks_and_recreation.employee_salary
GROUP BY occupation;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

12 rows affected.

+---------------------------------------------------+--------------+
|                     occupation                    | AVG(salary)  |
+---------------------------------------------------+--------------+
|      Deputy Director of Parks and Recreation      |  75000.0000  |
|          Director of Parks and Recreation         |  70000.0000  |
|                    Entrepreneur                   |  50000.0000  |
| Assistant to the Director of Parks and Recreation |  25000.0000  |
|                   Office Manager                  |  55000.0000  |
|                       Nurse                       |  55000.0000  |
|                    City Manager                   |  90000.0000  |
|                   State Auditor                   |  70000.0000  |
|              Shoe Shiner and Musician             |  20000.0000  |
|                    City Planner                   |  57000.0000  |
|                   Parks Director                  |  65000.0000  |
|               Exnternainment 720 CEO              | 1000000.0000 |
+---------------------------------------------------+--------------+

In [39]:
%%sql
SELECT
    occupation,
    AVG(salary)
FROM
    parks_and_recreation.employee_salary
WHERE occupation LIKE "%manager%"
GROUP BY occupation;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

2 rows affected.

+----------------+-------------+
|   occupation   | AVG(salary) |
+----------------+-------------+
| Office Manager |  55000.0000 |
|  City Manager  |  90000.0000 |
+----------------+-------------+

In [40]:
%%sql
SELECT
    occupation,
    AVG(salary)
FROM
    parks_and_recreation.employee_salary
WHERE occupation LIKE "%manager%"
GROUP BY occupation
HAVING AVG(salary) > 75000;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

1 rows affected.

+--------------+-------------+
|  occupation  | AVG(salary) |
+--------------+-------------+
| City Manager |  90000.0000 |
+--------------+-------------+

## SQL_05
Limit + Aliasing

In [41]:
%%sql
SELECT *
FROM
    parks_and_recreation.employee_demographics;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

12 rows affected.

+-------------+---------------+--------------+------+--------+------------+
| employee_id |   first_name  |  last_name   | age  | gender | birth_date |
+-------------+---------------+--------------+------+--------+------------+
|      1      |     Leslie    |    Knope     |  44  | Female | 1979-09-25 |
|      3      |      Tom      |  Haverford   |  36  |  Male  | 1987-03-04 |
|      4      |     April     |   Ludgate    |  29  | Female | 1994-03-27 |
|      5      |     Jerry     |   Gergich    |  61  |  Male  | 1962-08-28 |
|      6      |     Donna     |    Meagle    |  46  | Female | 1977-07-30 |
|      7      |      Ann      |   Perkins    |  35  | Female | 1988-12-01 |
|      8      |     Chris     |   Traeger    |  43  |  Male  | 1980-11-11 |
|      9      |      Ben      |    Wyatt     |  38  |  Male  | 1985-07-26 |
|      10     |      Andy     |    Dwyer     |  34  |  Male  | 1989-03-25 |
|      11     |      Mark     | Brendanawicz |  40  |  Male  | 1983-06-14 |
|      12     |     Craig     | Middlebrooks |  37  |  Male  | 1986-07-27 |
|      13     | Jean-Ralphino |  Saperstein  | None |  None  |    None    |
+-------------+---------------+--------------+------+--------+------------+

In [42]:
%%sql
SELECT *
FROM
    parks_and_recreation.employee_demographics
LIMIT 3;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

3 rows affected.

+-------------+------------+-----------+-----+--------+------------+
| employee_id | first_name | last_name | age | gender | birth_date |
+-------------+------------+-----------+-----+--------+------------+
|      1      |   Leslie   |   Knope   |  44 | Female | 1979-09-25 |
|      3      |    Tom     | Haverford |  36 |  Male  | 1987-03-04 |
|      4      |   April    |  Ludgate  |  29 | Female | 1994-03-27 |
+-------------+------------+-----------+-----+--------+------------+

In [43]:
%%sql
SELECT *
FROM
    parks_and_recreation.employee_demographics
ORDER BY age DESC;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

12 rows affected.

+-------------+---------------+--------------+------+--------+------------+
| employee_id |   first_name  |  last_name   | age  | gender | birth_date |
+-------------+---------------+--------------+------+--------+------------+
|      5      |     Jerry     |   Gergich    |  61  |  Male  | 1962-08-28 |
|      6      |     Donna     |    Meagle    |  46  | Female | 1977-07-30 |
|      1      |     Leslie    |    Knope     |  44  | Female | 1979-09-25 |
|      8      |     Chris     |   Traeger    |  43  |  Male  | 1980-11-11 |
|      11     |      Mark     | Brendanawicz |  40  |  Male  | 1983-06-14 |
|      9      |      Ben      |    Wyatt     |  38  |  Male  | 1985-07-26 |
|      12     |     Craig     | Middlebrooks |  37  |  Male  | 1986-07-27 |
|      3      |      Tom      |  Haverford   |  36  |  Male  | 1987-03-04 |
|      7      |      Ann      |   Perkins    |  35  | Female | 1988-12-01 |
|      10     |      Andy     |    Dwyer     |  34  |  Male  | 1989-03-25 |
|      4      |     April     |   Ludgate    |  29  | Female | 1994-03-27 |
|      13     | Jean-Ralphino |  Saperstein  | None |  None  |    None    |
+-------------+---------------+--------------+------+--------+------------+

In [44]:
%%sql
SELECT *
FROM
    parks_and_recreation.employee_demographics
ORDER BY age DESc
LIMIT 3, 1;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

1 rows affected.

+-------------+------------+-----------+-----+--------+------------+
| employee_id | first_name | last_name | age | gender | birth_date |
+-------------+------------+-----------+-----+--------+------------+
|      8      |   Chris    |  Traeger  |  43 |  Male  | 1980-11-11 |
+-------------+------------+-----------+-----+--------+------------+

In [45]:
%%sql
SELECT
    gender,
    AVG(age)
FROM
    parks_and_recreation.employee_demographics
GROUP BY gender;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

3 rows affected.

+--------+----------+
| gender | AVG(age) |
+--------+----------+
| Female | 38.5000  |
|  Male  | 41.2857  |
|  None  |   None   |
+--------+----------+

In [46]:
%%sql
SELECT
    gender,
    AVG(age) AS avg_age --AS is "optional"
FROM
    parks_and_recreation.employee_demographics
GROUP BY gender
HAVING avg_age > 40;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

1 rows affected.

+--------+---------+
| gender | avg_age |
+--------+---------+
|  Male  | 41.2857 |
+--------+---------+

## SQL_06
Joins

![JOINS](pics/joins.png)

### Inner Join

In [47]:
%%sql
SELECT *
FROM
    parks_and_recreation.employee_demographics
INNER JOIN
    parks_and_recreation.employee_salary ON employee_demographics.employee_id = employee_salary.employee_id

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

12 rows affected.

+-------------+---------------+--------------+------+--------+------------+---------------+---------------+--------------+---------------------------------------------------+---------+---------+
| employee_id |   first_name  |  last_name   | age  | gender | birth_date | employee_id_1 |  first_name_1 | last_name_1  |                     occupation                    |  salary | dept_id |
+-------------+---------------+--------------+------+--------+------------+---------------+---------------+--------------+---------------------------------------------------+---------+---------+
|      1      |     Leslie    |    Knope     |  44  | Female | 1979-09-25 |       1       |     Leslie    |    Knope     |      Deputy Director of Parks and Recreation      |  75000  |    1    |
|      3      |      Tom      |  Haverford   |  36  |  Male  | 1987-03-04 |       3       |      Tom      |  Haverford   |                    Entrepreneur                   |  50000  |    1    |
|      4      |     April     |   Ludgate    |  29  | Female | 1994-03-27 |       4       |     April     |   Ludgate    | Assistant to the Director of Parks and Recreation |  25000  |    1    |
|      5      |     Jerry     |   Gergich    |  61  |  Male  | 1962-08-28 |       5       |     Jerry     |   Gergich    |                   Office Manager                  |  50000  |    1    |
|      6      |     Donna     |    Meagle    |  46  | Female | 1977-07-30 |       6       |     Donna     |    Meagle    |                   Office Manager                  |  60000  |    1    |
|      7      |      Ann      |   Perkins    |  35  | Female | 1988-12-01 |       7       |      Ann      |   Perkins    |                       Nurse                       |  55000  |    4    |
|      8      |     Chris     |   Traeger    |  43  |  Male  | 1980-11-11 |       8       |     Chris     |   Traeger    |                    City Manager                   |  90000  |    3    |
|      9      |      Ben      |    Wyatt     |  38  |  Male  | 1985-07-26 |       9       |      Ben      |    Wyatt     |                   State Auditor                   |  70000  |    6    |
|      10     |      Andy     |    Dwyer     |  34  |  Male  | 1989-03-25 |       10      |      Andy     |    Dwyer     |              Shoe Shiner and Musician             |  20000  |   None  |
|      11     |      Mark     | Brendanawicz |  40  |  Male  | 1983-06-14 |       11      |      Mark     | Brendanawicz |                    City Planner                   |  57000  |    3    |
|      12     |     Craig     | Middlebrooks |  37  |  Male  | 1986-07-27 |       12      |     Craig     | Middlebrooks |                   Parks Director                  |  65000  |    1    |
|      13     | Jean-Ralphino |  Saperstein  | None |  None  |    None    |       13      | Jean-Ralphino |  Saperstein  |               Exnternainment 720 CEO              | 1000000 |   None  |
+-------------+---------------+--------------+------+--------+------------+---------------+---------------+--------------+---------------------------------------------------+---------+---------+

In [ ]:
%%sql
SELECT
    dem.employee_id,
    dem.age,
    sal.occupation
FROM
    parks_and_recreation.employee_demographics AS dem
INNER JOIN
    parks_and_recreation.employee_salary AS sal ON dem.employee_id = sal.employee_id;

Running query in 'mysql+mysqldb://root:***@localhost:3306/parks_and_recreation'

12 rows affected.

+-------------+------+---------------------------------------------------+
| employee_id | age  |                     occupation                    |
+-------------+------+---------------------------------------------------+
|      1      |  44  |      Deputy Director of Parks and Recreation      |
|      3      |  36  |                    Entrepreneur                   |
|      4      |  29  | Assistant to the Director of Parks and Recreation |
|      5      |  61  |                   Office Manager                  |
|      6      |  46  |                   Office Manager                  |
|      7      |  35  |                       Nurse                       |
|      8      |  43  |                    City Manager                   |
|      9      |  38  |                   State Auditor                   |
|      10     |  34  |              Shoe Shiner and Musician             |
|      11     |  40  |                    City Planner                   |
|      12     |  37  |                   Parks Director                  |
|      13     | None |               Exnternainment 720 CEO              |
+-------------+------+---------------------------------------------------+

### Outer Joins

In [ ]:
%%sql
SELECT
    dem.employee_id,
    dem.age,
    sal.occupation
FROM
    parks_and_recreation.employee_demographics AS dem
LEFT JOIN
    parks_and_recreation.employee_salary AS sal ON dem.employee_id = sal.employee_id;

In [ ]:
%%sql
SELECT
    dem.employee_id,
    dem.age,
    sal.occupation
FROM
    parks_and_recreation.employee_demographics AS dem
RIGHT JOIN
    parks_and_recreation.employee_salary AS sal ON dem.employee_id = sal.employee_id;

Self Join

In [ ]:
%%sql
SELECT *
FROM
    parks_and_recreation.employee_salary emp1
JOIN
    parks_and_recreation.employee_salary emp2 ON emp1.employee_id = emp2.employee_id;

In [ ]:
%%sql
SELECT *
FROM
    parks_and_recreation.employee_salary emp1
JOIN
    parks_and_recreation.employee_salary emp2 ON emp1.employee_id + 1 = emp2.employee_id;

Joining multiple tables together

In [ ]:
%%sql
SELECT *
FROM
    parks_and_recreation.employee_demographics AS dem
INNER JOIN
    parks_and_recreation.employee_salary AS sal ON dem.employee_id = sal.employee_id
INNER JOIN
    parks_and_recreation.parks_departments AS pd ON sal.dept_id = pd.department_id;

## SQL_07
Unions

In [ ]:
%%sql
SELECT *
FROM
    parks_and_recreation.employee_demographics;

In [ ]:
%%sql
SELECT
    age,
    gender
FROM
    parks_and_recreation.employee_demographics
UNION
SELECT
    first_name,
    last_name
FROM
    parks_and_recreation.employee_salary;

In [ ]:
%%sql
SELECT
    first_name,
    last_name
FROM
    parks_and_recreation.employee_demographics
UNION
SELECT
    first_name,
    last_name
FROM
    parks_and_recreation.employee_salary;

In [ ]:
%%sql
SELECT
    first_name,
    last_name
FROM
    parks_and_recreation.employee_demographics
UNION DISTINCT
SELECT
    first_name,
    last_name
FROM
    parks_and_recreation.employee_salary;

In [ ]:
%%sql
SELECT
    first_name,
    last_name
FROM
    parks_and_recreation.employee_demographics
UNION ALL
SELECT
    first_name,
    last_name
FROM
    parks_and_recreation.employee_salary;

In [ ]:
%%sql
SELECT
    first_name,
    last_name,
    "Old"
FROM
    parks_and_recreation.employee_demographics
WHERE age > 50;

In [ ]:
%%sql
SELECT
    first_name,
    last_name,
    "Old" AS Label
FROM
    parks_and_recreation.employee_demographics
WHERE age > 50;

In [ ]:
%%sql
SELECT
    first_name,
    last_name,
    "Old" AS Label
FROM
    parks_and_recreation.employee_demographics
WHERE age > 50
UNION
SELECT
    first_name, last_name, "Highly Paid Employee" AS Label
FROM
    parks_and_recreation.employee_salary
WHERE salary > 70000;

In [ ]:
%%sql
SELECT
    first_name,
    last_name, 
    "Old Man" AS Label
FROM
    parks_and_recreation.employee_demographics
WHERE age > 40 AND gender = "Male"
UNION
SELECT
    first_name,
    last_name, 
    "Old Lady" AS Label
FROM
    parks_and_recreation.employee_demographics
WHERE age > 40 AND gender = "Female"
UNION
SELECT
    first_name,
    last_name,
    "Highly Paid Employee" AS Label
FROM
    parks_and_recreation.employee_salary
WHERE salary > 70000
ORDER BY first_name, last_name;

## SQL_08
String functions

In [ ]:
%%sql
SELECT LENGTH("skyfall");

In [ ]:
%%sql
SELECT
    first_name,
    LENGTH(first_name) AS Largo
FROM
    parks_and_recreation.employee_demographics
ORDER BY 2;

In [ ]:
%sql SELECT UPPER("sky");

In [ ]:
%sql SELECT LOWER("SKY");

In [ ]:
%%sql
SELECT
    first_name,
    UPPER(first_name)
FROM
    parks_and_recreation.employee_demographics;

In [ ]:
%%sql
SELECT
    first_name,
    LOWER(first_name)
FROM
    parks_and_recreation.employee_demographics;

In [ ]:
%%sql
SELECT TRIM('    sky    ');

In [ ]:
%%sql
SELECT LTRIM('    sky    ');

In [ ]:
%%sql
SELECT RTRIM('    sky    ');

In [ ]:
%%sql
SELECT
    first_name,
    LEFT(first_name, 4),
    RIGHT(first_name, 4),
    SUBSTRING(first_name, 3, 2),
    birth_date,
    SUBSTRING(birth_date, 6, 2) AS Month
FROM
    parks_and_recreation.employee_demographics;

In [ ]:
%%sql
SELECT
    first_name,
    REPLACE(first_name, "a", "z")
FROM
    parks_and_recreation.employee_demographics;

In [ ]:
%%sql
SELECT
    first_name, 
    LOCATE("An", first_name)
FROM
    parks_and_recreation.employee_demographics;

In [ ]:
%%sql
SELECT
    first_name,
    last_name,
    CONCAT(first_name, " ", last_name) AS "Full name"
FROM
    parks_and_recreation.employee_demographics;

## SQL_09
Case statements

In [ ]:
%%sql
SELECT
    first_name,
    last_name,
    age,
CASE WHEN age <= 30 THEN "Young"
    WHEN age BETWEEN 31 AND 50 THEN "Old"
    WHEN age >= 50 THEN "On Death's Door"
END AS alias
FROM
    parks_and_recreation.employee_demographics;

In [ ]:
%%sql
SELECT first_name, last_name, salary,
CASE
    WHEN salary < 50000 THEN salary * 1.05
    WHEN salary > 50000 THEN salary * 1.07
END AS "New salary",
CASE
    WHEN dept_id = 6 THEN salary * .10
END AS Bonus
FROM parks_and_recreation.employee_salary;

## SQL_10
Subqueries

In [ ]:
%%sql
SELECT *
FROM
    parks_and_recreation.employee_demographics
WHERE employee_id IN
(SELECT
     employee_id
FROM
    parks_and_recreation.employee_salary
WHERE dept_id = 1);

In [ ]:
%%sql
SELECT
    first_name,
    salary,
    (SELECT AVG(salary)
    FROM parks_and_recreation.employee_salary)
FROM parks_and_recreation.employee_salary;

In [ ]:
%%sql
SELECT
    gender,
    AVG(age),
    MAX(age),
    MIN(age),
    COUNT(age)
FROM
    parks_and_recreation.employee_demographics
GROUP BY gender;

In [ ]:
%%sql
SELECT *
FROM
    (SELECT
         gender,
         AVG(age),
         MAX(age),
         MIN(age),
         COUNT(age)
    FROM
         parks_and_recreation.employee_demographics
    GROUP BY gender) as Agg_table;

In [ ]:
%%sql
SELECT
    gender,
    AVG(`MAX(age)`)
FROM
    (SELECT
         gender,
         AVG(age),
         MAX(age),
         MIN(age),
         COUNT(age)
    FROM
         parks_and_recreation.employee_demographics
    GROUP BY gender) AS Agg_table
GROUP BY gender;

In [ ]:
%%sql
SELECT
    AVG(max_age)
FROM
    (SELECT
         gender,
         AVG(age) AS avg_age,
        MAX(age) AS max_age,
        MIN(age) AS min_age,
        COUNT(age)
    FROM
        parks_and_recreation.employee_demographics
    GROUP BY gender) as Agg_table;

## SQL_11
Window function

In [ ]:
%%sql
SELECT
    gender,
    AVG(salary) AS avg_salary
FROM
    parks_and_recreation.employee_demographics AS dem
JOIN
    parks_and_recreation.employee_salary AS sal ON dem.employee_id = sal.employee_id
GROUP BY gender;

In [ ]:
%%sql
SELECT
    dem.first_name,
    dem.last_name,
    dem.gender,
    AVG(sal.salary) OVER(PARTITION BY dem.gender)
FROM
    parks_and_recreation.employee_demographics AS dem
JOIN
    parks_and_recreation.employee_salary AS sal ON dem.employee_id = sal.employee_id;

In [ ]:
%%sql
SELECT
    dem.first_name,
    dem.last_name,
    dem.gender,
    SUM(sal.salary) OVER(PARTITION BY dem.gender)
FROM
    parks_and_recreation.employee_demographics AS dem
JOIN
    parks_and_recreation.employee_salary AS sal ON dem.employee_id = sal.employee_id;

In [ ]:
%%sql
SELECT
    dem.first_name,
    dem.last_name,
    dem.gender,
    sal.salary,
    SUM(sal.salary) OVER(PARTITION BY dem.gender ORDER BY dem.employee_id) AS "Rolling total"
FROM
    parks_and_recreation.employee_demographics AS dem
JOIN
    parks_and_recreation.employee_salary AS sal ON dem.employee_id = sal.employee_id;

In [ ]:
%%sql
SELECT
    dem.employee_id,
    dem.first_name,
    dem.last_name,
    dem.gender,
    sal.salary,
    ROW_NUMBER() over(PARTITION BY dem.gender) AS Test
FROM
    parks_and_recreation.employee_demographics AS dem
JOIN
    parks_and_recreation.employee_salary AS sal ON dem.employee_id = sal.employee_id;

In [ ]:
%%sql
SELECT
    dem.employee_id,
    dem.first_name,
    dem.last_name,
    dem.gender,
    sal.salary,
    ROW_NUMBER() over(PARTITION BY dem.gender ORDER BY sal.salary DESC) AS row_num,
    rank() over(PARTITION BY dem.gender ORDER BY sal.salary DESC) AS rank_number,
    dense_rank() over(PARTITION BY dem.gender ORDER BY sal.salary DESC) AS dense_number
FROM
    parks_and_recreation.employee_demographics AS dem
JOIN
    parks_and_recreation.employee_salary AS sal ON dem.employee_id = sal.employee_id

## SQL_12
CTEs

In [ ]:
%%sql
SELECT
    gender,
    AVG(sal.salary),
    MAX(sal.salary),
    MIN(sal.salary),
    COUNT(sal.salary)
FROM
    parks_and_recreation.employee_demographics AS dem
JOIN
    parks_and_recreation.employee_salary AS sal ON dem.employee_id = sal.employee_id
GROUP BY dem.gender;

In [ ]:
%%sql
WITH CTE_Example AS (
SELECT
    gender,
    AVG(sal.salary) avg_sal,
    MAX(sal.salary) max_sal,
    MIN(sal.salary) min_sal,
    COUNT(sal.salary) count_sal
FROM
    parks_and_recreation.employee_demographics AS dem
JOIN
    parks_and_recreation.employee_salary AS sal ON dem.employee_id = sal.employee_id
GROUP BY dem.gender)
SELECT
    AVG(avg_sal)
FROM
    CTE_Example;

In [ ]:
%%sql
SELECT
    AVG(avg_sal)
FROM
    (SELECT
        gender,
        AVG(sal.salary) avg_sal,
        MAX(sal.salary) max_sal,
        MIN(sal.salary) min_sal,
        COUNT(sal.salary) count_sal
    FROM
        parks_and_recreation.employee_demographics AS dem
    JOIN
        parks_and_recreation.employee_salary AS sal ON dem.employee_id = sal.employee_id
    GROUP BY dem.gender) AS example_subquery;

In [ ]:
%%sql
WITH CTE_Example AS (
SELECT
    employee_id,
    gender,
    birth_date
FROM
    parks_and_recreation.employee_demographics
WHERE birth_date > '1985-01-01'
),
CTE_Example2 AS
(
    SELECT
        employee_id,
        salary
    FROM
        employee_salary
    WHERE salary > 50000
)
SELECT *
FROM
    CTE_Example
JOIN
    CTE_Example2 ON CTE_Example.employee_id = CTE_Example2.employee_id;

In [ ]:
%%sql
WITH CTE_Example (Gender, AVG_Sal, MAX_Sal, MIN_Sal, COUNT_Sal) AS (
SELECT
    gender,
    AVG(sal.salary) avg_sal,
    MAX(sal.salary) max_sal,
    MIN(sal.salary) min_sal,
    COUNT(sal.salary) count_sal
FROM
    parks_and_recreation.employee_demographics AS dem
JOIN
    parks_and_recreation.employee_salary AS sal ON dem.employee_id = sal.employee_id
GROUP BY dem.gender)
SELECT *
FROM
    CTE_Example;

## SQL_13
Temp tables

```sql
CREATE TEMPORARY TABLE temp_table
(first_name varchar(50),
last_name varchar (50),
favorite_movie varchar(199)
);
```

```sql
%%sql
SELECT *
FROM
    parks_and_recreation.temp_table;
```

```sql
INSERT INTO temp_table
VALUES('Alex', 'Freberg', 'Lord of the Rings: The Two Towers');
```

```sql
%%sql
SELECT *
FROM
    temp_table;
```

```sql
%%sql
CREATE TEMPORARY TABLE salary_over_50k
SELECT *
FROM parks_and_recreation.employee_salary
WHERE salary >= 50000;
```

```sql
%%sql
SELECT *
FROM
    salary_over_50k;
```

## SQL_14
Store Procedures

In [ ]:
%%sql
SELECT *
FROM
    parks_and_recreation.employee_salary
WHERE salary >= 50000;

```sql
%%sql
CREATE procedure large_salaries()
SELECT *
FROM
	parks_and_recreation.employee_salary
WHERE salary >= 50000;
```

```sql
%%sql
CALL large_salaries()
```

```sql
%%sql
DELIMITER $$
CREATE procedure large_salaries2()
BEGIN
	SELECT *
	FROM
		parks_and_recreation.employee_salary
	WHERE salary >= 50000;
	SELECT *
	FROM
		parks_and_recreation.employee_salary
	WHERE salary >= 10000;
END $$
DELIMITER ;

CALL large_salaries2();
```

```sql
%%sql
USE `parks_and_recreation`;
DROP procedure IF EXITS `new_procedure`;

DELIMITER $$
USE `parks_and_recreation`$$
CREATE PROCEDURE `new_procedure` ()
BEGIN
     SELECT *
    FROM
        parks_and_recreation.employee_salary
    WHERE salary >= 50000;
    SELECT *
    FROM
        parks_and_recreation.employee_salary
    WHERE salary >
 10000
    ;
END $$
DELIMITER ;
```

```sql
DELIMITER $$
CREATE procedure large_salaries4(employee_id INT)
BEGIN
	SELECT salary
	FROM
		parks_and_recreation.employee_salary
	WHERE employee_id = employee_id;
END $$
DELIMITER 
```

```sql
CALL large_salaries4(1)
```

## SQL_15
Triggers and Events

```sql
DELIMITER $$
CREATE TRIGGER employee_insert
	AFTER INSERT ON employee_salary
    FOR EACH ROW
BEGIN
	INSERT INTO employee_demographics (employee_id, first_name, last_name)
    VALUES (NEW.employee_id, NEW.first_name, NEW.last_name);
END $$
    
DELIMITER ;
```

```sql
INSERT INTO employee_salary (employee_id, first_name, last_name, occupation, salary, dept_id)
VALUES (13, 'Jean-Ralphino', 'Saperstein', 'Exnternainment 720 CEO', 1000000, NULL);
```

```sql
DELIMITER $$
CREATE EVENT delete_retirees
ON SCHEDULE EVERY 30 SECOND
DO
BEGIN
	DELETE
    FROM
		employee_demographics
	WHERE age >= 60;
END $$

DELIMITER ;
```

```sql
SELECT *
FROM
    parks_and_recreation.employee_demographics;
```